app/controllers/experiments_controller.rb

SELECT * FROM `studies` WHERE (`studies`.investigation_id = 1) ORDER BY studies.updated_at DESC
SELECT * FROM `investigations` ORDER BY investigations.updated_at DESC
---
  def new
    @experiment=Experiment.new
    @experiment.create_from_asset = params[:create_from_asset]
    study = Study.find(params[:study_id]) if params[:study_id]
    @experiment.study = study if params[:study_id] if study.try :can_edit?
    @experiment_class=params[:class]
    @experiment.experiment_class=ExperimentClass.for_type(@experiment_class) unless @experiment_class.nil?

    investigations = Investigation.all.select &:can_view?

INSERT INTO `experiments` (`owner_id`, `updated_at`, `first_letter`, `uuid`, `created_at`, `study_id`, `experiment_class_id`, `institution_id`, `technology_type_id`, `title`, `policy_id`, `experiment_type_id`, `description`) VALUES(1, '2012-08-28 15:32:57', 'P', '83e81394-f49c-45c7-b01e-a3e4a6f3da99', '2012-08-28 15:32:57', 1, 1, NULL, 1001759783, 'Predicting whether people view dynamic content on the Web', 29, 41899701, 'Predicting whether people view dynamic content on the Web')
INSERT INTO `policies` (`access_type`, `use_blacklist`, `updated_at`, `created_at`, `name`, `sharing_scope`, `use_whitelist`) VALUES(0, 0, '2012-08-28 15:32:52', '2012-08-28 15:32:52', 'default private', 0, 0)
SELECT * FROM `data_files` WHERE (`data_files`.`id` IN (NULL)) ORDER BY data_files.updated_at DESC
SELECT * FROM `data_files` WHERE (`data_files`.`policy_id` = 29) ORDER BY data_files.updated_at DESC
SELECT * FROM `experiments` WHERE (`experiments`.`policy_id` = 29) ORDER BY experiments.updated_at DESC
SELECT * FROM `policies` WHERE (`policies`.`id` = 28)
SELECT `projects`.id FROM `projects` INNER JOIN `investigations_projects` ON `projects`.id = `investigations_projects`.project_id WHERE (`projects`.`id` = 1) AND (`investigations_projects`.investigation_id = 1 ) ORDER BY projects.name LIMIT 1
---
  def create
    @experiment        = Experiment.new(params[:experiment])

    organisms     = params[:experiment_organism_ids] || []
    protocol_ids       = params[:experiment_protocol_ids] || []
    data_file_ids = params[:data_file_ids] || []
    model_ids     = params[:experiment_model_ids] || []


     organisms.each do |text|
      o_id, strain, culture_growth_type_text=text.split(",")
      culture_growth=CultureGrowthType.find_by_title(culture_growth_type_text)
      @experiment.associate_organism(o_id, strain, culture_growth)
    end


    update_annotations @experiment

    @experiment.owner=current_user.person

    @experiment.policy.set_attributes_with_sharing params[:sharing], @experiment.projects


      if @experiment.save
        data_file_ids.each do |text|
          a_id, r_type = text.split(",")
          d = DataFile.find(a_id)
          @experiment.relate(d, RelationshipType.find_by_title(r_type)) if d.can_view?

SELECT * FROM `protocols` WHERE (`protocols`.`id` IN (NULL)) ORDER BY protocols.updated_at DESC
---
          @experiment.relate(m) if m.can_view?
        end
        protocol_ids.each do |a_id|
          s = Protocol.find(a_id)

SELECT * FROM `publications` ORDER BY id DESC, publications.published_date ASC LIMIT 1
---
        end

        # update related publications
        Relationship.create_or_update_attributions(@experiment, params[:related_publication_ids].collect { |i| ["Publication", i.split(",").first] }, Relationship::RELATED_TO_PUBLICATION) unless params[:related_publication_ids].nil?