app/controllers/institutions_controller.rb

SELECT * FROM `institutions` WHERE (`institutions`.`id` = 1) ORDER BY institutions.name
---
  def show
    @institution = Institution.find(params[:id])

INSERT INTO `institutions` (`created_at`, `name`, `first_letter`, `city`, `avatar_id`, `uuid`, `web_page`, `updated_at`, `address`, `country`) VALUES('2012-08-28 08:34:30', 'University of Manchester', 'U', 'Manchester', NULL, '86a86e42-b520-4ce0-bc5b-deb3a52a93ee', 'http://cs.manchester.ac.uk/', '2012-08-28 08:34:30', '', 'United Kingdom')
---
  def create
    @institution = Institution.new(params[:institution])

    respond_to do |format|
      if @institution.save