app/controllers/people_controller.rb

  def select
    @userless_projects=Project.with_userless_people

    #strip out project with no people with email addresses
    #TODO: can be made more efficient by putting into a direct query in Project.with_userless_people - but not critical as this is only used during registration
    @userless_projects = @userless_projects.select do |proj|
      !proj.people.find{|person| !person.email.nil? && person.user.nil?}.nil?
---
SELECT * FROM `projects` ORDER BY projects.name
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1


          #send mail to project managers
          project_managers = project_managers_of_selected_projects params[:projects]
          project_managers.each do |project_manager|
---
SELECT * FROM `projects` ORDER BY projects.name

  def set_group_membership_project_role_ids person,params
    #FIXME: Consider updating to Rails 2.3 and use Nested forms to handle this more cleanly.
    prefix="group_membership_role_ids_"
    person.group_memberships.each do |gr|
---
SELECT * FROM `group_memberships` WHERE (`group_memberships`.person_id = 1)
SELECT `work_groups`.* FROM `work_groups` INNER JOIN `group_memberships` ON `work_groups`.id = `group_memberships`.work_group_id WHERE ((`group_memberships`.person_id = 1)) AND ((`group_memberships`.person_id = 1))