app/controllers/policies_controller.rb

  def preview_permissions
      set_no_layout
      creators = (params["creators"].blank? ? [] : ActiveSupport::JSON.decode(params["creators"])).uniq
      creators.collect!{|c| Person.find(c[1])}
      asset_managers = []
      selected_projects = get_selected_projects params[:project_ids], params[:resource_name]
      selected_projects.each do |project|
        asset_managers |= project.asset_managers
      end

      policy = sharing_params_to_policy
      if params['is_new_file'] == 'false'
        contributor = try_block{User.find_by_id(params['contributor_id'].to_i).person}
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1