app/controllers/publications_controller.rb

SELECT * FROM `publications` WHERE (`publications`.`id` = '0') ORDER BY publications.published_date DESC LIMIT 1
---
  def preview
    element=params[:element]
    @publication = Publication.find_by_id(params[:id])